Revit.Elements.Views.ScheduleView
Base class for Revit Plan views

Revit.Elements.Views.ScheduleView.InternalViewSchedule
An internal handle on the Revit element

Revit.Elements.Views.ScheduleView.InternalElement
Reference to the Element

Revit.Elements.Views.ScheduleView.InternalScheduleFilters
Reference to Schedule Filters

Revit.Elements.Views.ScheduleView.#ctor(Autodesk.Revit.DB.ViewSchedule)
Private constructor

Revit.Elements.Views.ScheduleView.#ctor(Revit.Elements.Category,System.String,Revit.Elements.Views.ScheduleView.ScheduleType)
Private constructor

Revit.Elements.Views.ScheduleView.InitScheduleView(Autodesk.Revit.DB.ViewSchedule)
Initialize a ScheduleView element

Revit.Elements.Views.ScheduleView.InitScheduleView(Revit.Elements.Category,System.String,Revit.Elements.Views.ScheduleView.ScheduleType)
Initialize a ViewSchedule Element.
category:
name:
type:

Revit.Elements.Views.ScheduleView.InternalSetScheduleView(Autodesk.Revit.DB.ViewSchedule)
Set the InternalViewSchedule property and the associated element id and unique id
view:

Revit.Elements.Views.ScheduleView.CreateSchedule(Revit.Elements.Category,System.String,System.String)
Create Schedule by Category, Type and Name.
category: Category that Schedule will be associated with.
name: Name of the Schedule View.
scheduleType: Type of Schedule View to be created. Ex. Key Schedule.
Schedule View.

Revit.Elements.Views.ScheduleView.RemoveFields(System.Collections.Generic.List{Revit.Schedules.ScheduleField})
Remove Schedule Field from Schedule View.
fields: Schedule Fields (columns) to be removed.
Schedule View.

Revit.Elements.Views.ScheduleView.AddFields(System.Collections.Generic.List{Revit.Schedules.SchedulableField})
Add Field (Column) to Schedule View.
fields: Schedulable Field retrieved from ScheduleView.SchedulableFields.
Schedule View.

Revit.Elements.Views.ScheduleView.Export(System.String,Revit.Schedules.ScheduleExportOptions)
Export View Schedule to CSV, TSV etc.
path: A valid file path with file extension.
exportOptions: Export Options. If null, default will be used.
Schedule View.

Revit.Elements.Views.ScheduleView.AddFilters(System.Collections.Generic.List{Revit.Schedules.ScheduleFilter})
Add Schedule Filters to Schedule View.
scheduleFilters: List of Schedule Filters.
Schedule View.

Revit.Elements.Views.ScheduleView.ClearAllFilters
Clear all Schedule Filters from Schedule View.
Schedule View.

Revit.Elements.Views.ScheduleView.ScheduleFilters
Schedule Filters.

Revit.Elements.Views.ScheduleView.Fields
Schedule Fields.

Revit.Elements.Views.ScheduleView.SchedulableFields
Schedulable Fields.

Revit.Elements.Views.ScheduleView.FromExisting(Autodesk.Revit.DB.ViewSchedule,System.Boolean)
Create a View from a user selected Element.
view:
isRevitOwned:
Returns: